/* Description for disconnection warning setting */
"1 Minute Alert Before Disconnection" = "Figyelmeztetés a szétkapcsolás előtt 1 perccel";

/* Error string for OTR message string */
"A private conversation could not be set up." = "A private conversation could not be set up.";

/* Title for the about page */
"About" = "Az alkalmazásról";

/* Label for button to show version numbers and licenses */
"About This Version" = "About This Version";

/* SSL error message */
"Access denied" = "Hozzáférés megtagadva";

/* The string describing a buddy's account */
"Account" = "Fiók";

/* Error title when account is disconnected */
"Account Disconnected" = "Account Disconnected";

/* Title for showing the users account otr fingerprints */
"Account Fingerprints" = "Account Fingerprints";

/* Title for the accounts tab */
"Accounts" = "Fiókok";

/* Button title to add someone as a buddy */
"Add" = "Hozzáadás";

/* The title for the view to add a buddy */
"Add Buddy" = "Partner hozzáadása";

/* String to describe advanced set of settings */
"Advanced" = "Haladó";

/* Error string for OTR message string */
"An error occured while encrypting a message and the message was not sent." = "An error occured while encrypting a message and the message was not sent.";

/* shown when changing database passphrase fails */
"An error occurred while changing the database passphrase." = "An error occurred while changing the database passphrase.";

/* Error message when setting up database */
"An error occurred while setting up the database." = "An error occurred while setting up the database.";

/* SSL error message */
"Attempt to restore an unknown session" = "Attempt to restore an unknown session";

/* Title for automatic conversation deletion setting */
"Auto-delete" = "Törlés automatikusan";

/* string for title yes/no setting for allowing opportunistic otr */
"Auto-start Encryption" = "Kódolás automatikus indítása";

/* Label in buddy list for users that are available */
"Available" = "Elérhető";

/* Label in buddy list for users that are away */
"Away" = "Távol";

/* Message displayed in Notification Manager when session will expire in one minute */
"Background session will expire in one minute." = "A háttér folyamat 1 perc múlva lejár.";

/* SSL error message */
"Bad certificate format" = "Hibás tanúsítvány forma ";

/* SSL error message */
"Bad MAC" = "Hibás MAC azonosító";

/* SSL error message */
"Bad protocol version" = "Hibás protokoll verzió";

/* SSL error message */
"Bad SSLCipherSuite" = "Bad SSLCipherSuite";

/* SSL error message */
"Bad unsupported cert format" = "Bad unsupported cert format";

/* string to describe basic set of settings */
"Basic" = "Alapvető";

/* Text describing what happens when the user has forgotten the passphrase */
"Because the database contents is encrypted with your passphrase, you've lost access to your data and will need to delete and reinstall ChatSecure to continue. Password managers like 1Password or MiniKeePass can be helpful for generating and storing strong passwords." = "Because the database contents is encrypted with your passphrase, you've lost access to your data and will need to delete and reinstall ChatSecure to continue. Password managers like 1Password or MiniKeePass can be helpful for generating and storing strong passwords.";

/* The String for a button to block a buddy */
"Block" = "Blokkol";

/* The String for a buddy to block and remove a buddy from the buddy list */
"Block & Remove" = "Blokkolás és eltávolítás";

/* Title for showing the users buddies otr fingerprints */
"Buddy Fingerprints" = "Buddy Fingerprints";

/* The title for the view that shows detailed buddy info */
"Buddy Info" = "Partner infó";

/* Title for the buddy list tab */
"Buddy List" = "Partnerlista";

/* Cancel an alert window */
"Cancel" = "Mégse";

/* Shown when ending an encrypted chat session */
"Cancel Encrypted Chat" = "Titkosított beszélgetés befejezése";

/* Error string for OTR message string */
"Cannot read the received message." = "Cannot read the received message.";

/* Error string for OTR message string */
"Cannot recognize the type of OTR message received." = "Cannot recognize the type of OTR message received.";

/* SSL error message */
"Cert chain not verified by root" = "Cert chain not verified by root";

/* SSL error message */
"Certificate expired" = "Certificate expired";

/* SSL error message */
"Certificate revoked" = "Certificate revoked";

/* SSL error message */
"Chain had a cert not yet valid" = "Chain had a cert not yet valid";

/* SSL error message */
"Chain had an expired cert" = "Chain had an expired cert";

/* Title for button to change encrypted database passphrase */
"Change Passphrase" = "Change Passphrase";

/* Title for chat view */
"Chat" = "Beszélgetés";

/* Body of SMS or email when sharing a link to the app */
"Chat with me securely" = "Csevegj velem biztonságosan";

/* Title for chats view */
"Chats" = "Chats";

/* Title for ChatSecure Push (this probably doesnt need to be translated) */
"ChatSecure Push" = "ChatSecure Push";

/* let users know source is on Github */
"Check out the source here on Github" = "Nézze meg a forráskódunkat itt, a csapat GitHub tárolójában";

/* SSL error message */
"Cipher Suite negotiation failure" = "Cipher Suite negotiation failure";

/* Label for text field where you compose a new message */
"Compose" = "Compose";

/* SSL error message */
"Configuration error" = "Beállítás hiba";

/* Button label for connecting a Facebook account */
"Connect Facebook" = "Facebook csatlakozás";

/* Label for button to create account by logging into an existing account */
"Connect to Existing Account" = "Connect to Existing Account";

/* Whether or not account is logged in */
"Connected" = "Kapcsolt";

/* String to state if an account is progress of creating a connection */
"Connecting" = "Connecting";

/* Message shown when connecting to the Tor network */
"Connecting to Tor" = "Csatlakozás Tor hálózathoz";

/* SSL error message */
"Connection closed gracefully" = "Connection closed gracefully";

/* SSL error message */
"Connection closed via error" = "Connection closed via error";

/* Copy string to clipboard as in copy and paste */
"Copy" = "Másolás";

/* Error message when cannot get public key from SSL certificate */
"Could not retrieve public key from certificate" = "Could not retrieve public key from certificate";

/* Title for button to create account */
"Create" = "Létrehozás";

/* Label for button to create a new account via in band registration */
"Create New Account" = "Új fiók létrehozása";

/* Start of sentence that will be followed by names */
"Created by" = "Created by";

/* Title for progress of creating a new account */
"Creating Account" = "Fiók létrehozása";

/* title label for the existing passphrase */
"Current Passphrase" = "Current Passphrase";

/* SSL error message */
"Decoding error" = "Dekódolási hiba";

/* SSL error message */
"Decompression failure" = "Decompression failure";

/* SSL error message */
"Decryption error" = "Dekódolási hiba";

/* SSL error message */
"Decryption failed" = "Sikertelen dekódolás";

/* SSL error message */
"Decryption failure" = "Decryption failure";

/* default string to revert to normal language behaviour */
"Default" = "Alapértelmezett";

/* Ask user if they want to delete the stored account information */
"Delete Account?" = "Fiók törlése?";

/* Description for automatic conversation deletion */
"Delete chats on disconnect" = "Beszélgetések törlése szétkapcsoláskor";

/* Shows in the chat view when a message has been delivered */
"Delivered" = "Kézbesítve";

/* button label for disconnecting Facebook account */
"Disconnect Facebook" = "Facebook csatlakozás megszüntetése";

/* Default message when a user status is set to do not disturb */
"Do Not Disturb" = "Ne zavarj!";

/* Error message when domain textfield left blank */
"Domain needs to be set" = "Domain needs to be set";

/* Message when port is changed but domain not set */
"Domain needs to be set manually when specifying a custom port" = "Domain needs to be set manually when specifying a custom port";

/* Title for donation link */
"Donate" = "Adakozás";

/* Title for button to press when user is finished */
"Done" = "Kész";

/* Error title when there is a duplicate account */
"Duplicate account" = "Duplicate account";

/* The string describing account name or email address for a buddy */
"Email" = "Email";

/* string for decription yes/no setting for allowing opportunistic otr */
"Enables opportunistic OTR" = "Enables opportunistic OTR";

/* Generic title for encryption errors */
"Encryption Error" = "Encryption Error";

/* title label for error when creating account */
"Error Creating Account" = "Error Creating Account";

/* Error message when registration fails */
"Error Registering Username" = "Error Registering Username";

/* Title of error message pop-up box */
"Error!" = "Hiba!";

/* SSL error message */
"Export restriction" = "Export korlátozás";

/* Default message when a user status is set to extended away */
"Extended Away" = "Extended Away";

/* the name for facebook */
"Facebook" = "Facebook";

/* Message when cannot connect to XMPP server */
"Failed to connect to XMPP server. Please check your login credentials and internet connection and try again." = "Nem sikerült az XMPP szerverhez történő csatlakozás. Ellenőrizd a bejelentkezési adatokat és az internetkapcsolatod, majd próbálkozz újra.";

/* SSL error message */
"Fatal alert" = "Végzetes figyelmeztetés";

/* your fingerprint */
"Fingerprint for you" = "Az ujjlenyomatod";

/* Label for button when you've forgotten the passphrase */
"Forgot Passphrase?" = "Forgot Passphrase?";

/* Name of popular web based hosting service */
"GitHub" = "GitHub";

/* the name for Google talk */
"Google Talk" = "Google Talk";

/* SSL error message */
"Handshake failure" = "SSL kézfogási hiba";

/* Label for button to open link to translate app */
"Help Translate" = "Help Translate";

/* Label text for hostname field on login scree */
"Hostname" = "Állomásnév";

/* SSL error message */
"I/O would block (not fatal)" = "I/O would block (not fatal)";

/* SSL error message */
"Illegal parameter" = "Rossz paraméter";

/* Message alerting user that they need to return to the home screen and force close ChatSecure */
"In order to change languages return to the home screen and remove ChatSecure from the recently used apps" = "In order to change languages return to the home screen and remove ChatSecure from the recently used apps";

/* Short for information, button title to get more information */
"Info" = "Infó";

/* Shown when starting an encrypted chat session */
"Initiate Encrypted Chat" = "Titkosított üzenetküldés megkezdése";

/* SSL error message */
"Insufficient buffer provided" = "Insufficient buffer provided";

/* SSL error message */
"Insufficient security" = "Insufficient security";

/* SSL error message */
"Internal error" = "Belső hiba";

/* SSL error message */
"Invalid certificate chain" = "Invalid certificate chain";

/* title label for invalid email */
"Invalid Email" = "Invalid Email";

/* Directions to the system software update */
"iOS Vulnerability" = "iOS sebezhetőség";

/* Message shown in line for users that are available */
"is now available" = "most elérhető";

/* Message shown in line for users that are away */
"is now away" = "most távol van";

/* Message shown in line for users that are offline */
"is now offline" = "most nem elérhető";

/* the name for jabber, also include (XMPP) at the end */
"Jabber (XMPP)" = "Fecsegés (XMPP)";

/* string to bring up language selector */
"Language" = "Nyelv";

/* String of title to alert user language is change */
"Language Change" = "Nyelv megváltoztatása";

/* log in to account */
"Log In" = "Bejelentkezés";

/* log out from account */
"Log Out" = "Kijelentkezés";

/* shown during the login process */
"Logging in..." = "Bejelentkezés...";

/* Label for account setting that autologins on launch */
"Login Automatically" = "Automatikus bejelentkezés";

/* Title for button to manage ChatSecure Push account */
"Manage ChatSecure Push account" = "Manage ChatSecure Push account";

/* Subtitle lable for button to show saved fingerprints */
"Manage OTR fingerprints" = "OTR ujjlenyomatok kezelése";

/* subtitle for the certificate pinned setting */
"Manage saved SSL certificates" = "Manage saved SSL certificates";

/* Error string for OTR message string */
"Message has not been sent because our buddy has ended the private conversation. We should either close the connection, or refresh it." = "Message has not been sent because our buddy has ended the private conversation. We should either close the connection, or refresh it.";

/* SSL error message */
"Miscellaneous bad certificate" = "Miscellaneous bad certificate";

/* SSL error message */
"Module attach failure" = "Module attach failure";

/* The string describing a buddy's display name */
"Name" = "Név";

/* For a new settings value */
"New" = "Új";

/* Title for New Account View */
"New Account" = "Új fiók";

/* title label for the new passphrase */
"New Passphrase" = "New Passphrase";

/* Title for alert when a new SSL certificate is encountered */
"New SSL Certificate" = "New SSL Certificate";

/* Label for button to go to next step */
"Next" = "Next";

/* SSL error message */
"No Error" = "Nincs hiba";

/* SSL error message */
"No renegotiation allowed" = "No renegotiation allowed";

/* To let the user know the fingerprint as not been checked */
"Not Verified" = "Nem ellenőrzött";

/* Label in buddy list for users that are offline */
"Offline" = "Offline";

/* Accept the dialog */
"OK" = "OK";

/* For an old settings value */
"Old" = "Régi";

/* Label to open link in the chrome web browser */
"Open in Chrome" = "Open in Chrome";

/* Label for button to open link in facebook app */
"Open in Facebook" = "Open in Facebook";

/* Label for button to open link in twitter app */
"Open in Twitter" = "Open in Twitter";

/* Hint text for domain field telling user this field is not required */
"Optional" = "Választható";

/* the name for AIM */
"OSCAR Instant Messenger" = "OSCAR azonnali üzenetküldő";

/* Title for other miscellaneous settings group */
"Other" = "Más";

/* Lable for button to show saved fingerprints */
"OTR Fingerprints" = "OTR ujjlenyomat";

/* Error string for OTR message string */
"Our policy requires encryption but we are trying to send an unencrypted message out." = "Our policy requires encryption but we are trying to send an unencrypted message out.";

/* Label text for password field on login screen */
"Password" = "Jelszó";

/* SSL error message */
"Peer cert is valid, or was ignored if verification disabled" = "Peer cert is valid, or was ignored if verification disabled";

/* SSL error message */
"Peer dropped connection before responding" = "Peer dropped connection before responding";

/* SSL error message */
"Peer host name mismatch" = "Peer host name mismatch";

/* String for XMPP buddies when adding buddy is pending */
"Pending Approval" = "Pending Approval";

/* Ask user if they want to delete the stored account information */
"Permanently delete" = "Végleges törlés";

/* Button Lable to show all pinned SSL certificates */
"Pinned Certificates" = "Pinned Certificates";

/* detail title label for invalid email */
"Please choose a valid email address" = "Please choose a valid email address";

/* Error description when account is disconnected while managing requests */
"Please log into this account before managing requests." = "Please log into this account before managing requests.";

/* Label for port number field for connecting to service */
"Port" = "Port";

/* the alleged fingerprint of their other person */
"Purported fingerprint for" = "Feltételezett ujjlenyomat";

/* Title for push-messaging related settings */
"Push" = "Push";

/* Label for qr code image */
"QR code" = "QR code";

/* Error string for OTR message string */
"Received a general OTR error." = "Received a general OTR error.";

/* Error string for OTR message string */
"Received a heartbeat." = "Received a heartbeat.";

/* Error string for OTR message string */
"Received an encrypted message but cannot read it because no private connection is established yet." = "Received an encrypted message but cannot read it because no private connection is established yet.";

/* Error string for OTR message string */
"Received an unencrypted message." = "Received an unencrypted message.";

/* Error string for OTR message string */
"Received and discarded a message intended for another instance." = "Received and discarded a message intended for another instance.";

/* Error string for OTR message string */
"Received our own OTR messages." = "Received our own OTR messages.";

/* Title for header of Buddy list view with Recent Buddies */
"Recent" = "Újabbak";

/* SSL error message */
"Record overflow" = "Record overflow";

/* Button title to reject a request such as a buddy request */
"Reject" = "Visszautasít";

/* Label for switch to save passphrase */
"Remember Passphrase" = "Remember Passphrase";

/* label for switch for whether or not we should save their password between launches */
"Remember password" = "Jelszó megjegyzése";

/* The String for a button to remove a buddy from the buddy list */
"Remove" = "Eltávolít";

/* Reply to an incoming message */
"Reply" = "Válasz";

/* String to let user know a certain field like a password is required to create an account */
"Required" = "Szükséges";

/* Label for text input for XMPP resource */
"Resource" = "Forrás";

/* Title for button for saving a setting */
"Save" = "Mentés";

/* Title for listing the user saved SSL certificates */
"Saved Certificates" = "Saved Certificates";

/* Label for text field where you search for a buddy */
"Search" = "Search";

/* Title heading in settings */
"Security" = "Biztonság";

/* Title of alert box warning about security issues */
"Security Warning" = "Biztonsági figyelmeztetés";

/* string for settings to allow self signed SSL string */
"Self Signed SSL" = "Önmagát aláírt SSL";

/* String on button to email feedback */
"Send Feedback" = "Visszajelzés küldése";

/* Error string for OTR message string */
"Sent a heartbeat." = "Sent a heartbeat.";

/* SSL error message */
"Server closed session with no notification" = "Server closed session with no notification";

/* SSL error message */
"Server has requested a client cert" = "Server has requested a client cert";

/* Detail label for button to change encrypted database passphrase */
"Set new database passphrase" = "Set new database passphrase";

/* Title for the Settings screen */
"Settings" = "Beállítások";

/* Directions to the system software update */
"Settings -> General -> Software Update" = "Beállítások -> Általános -> Program frissítés";

/* Title for sharing a link to the app */
"Share" = "Megosztás";

/* Title for setting about showing a warning before disconnection */
"Sign out Warning" = "Figyelmeztetés: kijelentkezés!";

/* title label for signing up for a new account */
"Sign Up" = "Sign Up";

/* Label for button to skip this step */
"Skip" = "Skip";

/* string for settings to allow SSL mismatch */
"SSL Hostname Mismatch" = "SSL állomásnév eltérés";

/* SSL error message */
"SSL protocol error" = "SSL protokoll hiba";

/* Title of view where you can mange buddy or subscription requests */
"Subscription Requests" = "Subscription Requests";

/* Title to let user know that encryption is not currently enabled */
"The conversation is not secure" = "Ez a beszélgetés nem biztonságos";

/* Title to let user know that the OTR fingerprint has not been checked */
"The conversation is secure and the fingerprint is verfied" = "The conversation is secure and the fingerprint is verfied";

/* Warn user that the current chat is no longer secure */
"The conversation with %@ is no longer secure." = "A beszélgetés %@ partnerrel a továbbiakban nem biztonságos";

/* shown when changing database passphrase succeeds */
"The database passphrase change was successful." = "The database passphrase change was successful.";

/* Title to let user know that the OTR fingerprint has not been checked */
"The fingerprint has changed and needs to be verified" = "The fingerprint has changed and needs to be verified";

/* Title to let user know that the OTR fingerprint has not been checked */
"The fingerprint has not been verified" = "The fingerprint has not been verified";

/* Error string for OTR message string */
"The message received contains malformed data." = "The message received contains malformed data.";

/* Error string for OTR message string */
"The previous message was resent." = "The previous message was resent.";

/* Error message for when in band registration is not supported */
"The XMPP server does not support in-band registration" = "The XMPP server does not support in-band registration";

/* Error message when there is a duplicate account */
"There already exists an account with this username." = "There already exists an account with this username.";

/* Warns user that the current chat is secure */
"This chat is secured" = "Ez a beszélgetés biztonságos";

/* Error message when trying to make a purchase but payments haven't been set up yet */
"This device doesn't seem to be configured to make payments." = "This device doesn't seem to be configured to make payments.";

/* Instructions label text underneath QR code */
"This QR Code contains a link to http://omniqrcode.com/q/chatsecure and will redirect to the App Store." = "Ez a QR kód a http://omniqrcode.com/q/chatsecure vonatkozó hivatkozást tartalmaz és az alkalmazás boltba irányít.";

/* Message for warning about using tor network */
"Tor is an experimental feature, please use with caution." = "Tor is an experimental feature, please use with caution.";

/* Name of the popular social tweeting site */
"Twitter" = "Twitter";

/* SSL error message */
"Underlying cryptographic error" = "Underlying cryptographic error";

/* SSL error message */
"Unexpected (skipped) record in DTLS" = "Unexpected (skipped) record in DTLS";

/* SSL error message */
"Unexpected message received" = "Unexpected message received";

/* SSL error message */
"Unknown Cert Authority" = "Unknown Cert Authority";

/* SSL error message */
"Unknown certificate" = "Ismeretlen tanúsítvány";

/* Label for button to unlock app */
"Unlock" = "Unlock";

/* SSL error message */
"User canceled" = "User canceled";

/* Example of a username using the words user and example */
"user@example.com" = "user@example.com";

/* Label text for username field on login screen */
"Username" = "Felhasználónév";

/* SSL error message */
"Valid cert chain, untrusted root" = "Valid cert chain, untrusted root";

/* shown to show that the certificate was valid to the system */
"Valid certificate" = "Érvényes tanúsítvány";

/* To let the user know the fingerprint as been checked */
"Verified" = "Ellenőrzött";

/* Shown when verifying fingerprints */
"Verify" = "Megerősítés";

/* Title of the dialog for fingerprint verification */
"Verify Fingerprint" = "Ujjlenyomat megerősítése";

/* Shown when verifying fingerprints */
"Verify Later" = "Ellenőrzés később";

/* when displaying version numbers such as 1.0.0 */
"Version" = "Kiadás";

/* Warn user that the current chat is not secure */
"Warning: This chat is not encrypted" = "Figyelmeztetés! Ez a beszélgetés nem biztonságos!";

/* actionsheet for showing uservoice feedback service */
"Would you like to connect to UserVoice to send feedback?" = "Would you like to connect to UserVoice to send feedback?";

/* Title for xmpp accounts that connect through the Tor network */
"XMPP + Tor" = "XMPP + Tor";

/* Inform user that they must be secure their conversation before doing that action */
"You must be in a secure conversation first." = "Előbb egy bizalmas üzenetküldésben kell lenned.";

/* error message shown when user doesn't fill in a username or password */
"You must enter a username and a password to login." = "A bejelentkezéshez egy felhasználónévre és egy jelszóra lesz szükséged.";

/* Alert to system issues, leave in the %@ */
"Your current iOS system version (%@) contains a serious security vulnerability. Please update to the latest version as soon as possible." = "Your current iOS system version (%@) contains a serious security vulnerability. Please update to the latest version as soon as possible.";

/* Message shown when about to donate */
"Your donation will help fund the continued development of ChatSecure." = "Your donation will help fund the continued development of ChatSecure.";

/* Text that describes what remembering your passphrase does */
"Your password will be stored in the iOS Keychain of this device only, and is only as safe as your device passphrase or pin. However, it will not persist during a device backup/restore via iTunes, so please don't forget it, or you may lose your conversation history." = "Your password will be stored in the iOS Keychain of this device only, and is only as safe as your device passphrase or pin. However, it will not persist during a device backup/restore via iTunes, so please don't forget it, or you may lose your conversation history.";

